# RbsEnergyAnalysisViewOuterShellMode Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsEnergyAnalysisViewOuterShellMode Property
ParameterTypeId Class See Also
---
"Show Analytical Space Shells"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsEnergyAnalysisViewOuterShellMode { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsEnergyAnalysisViewOuterShellMode As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsEnergyAnalysisViewOuterShellMode {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace